[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:72:9
 ): Promise<PaymentProcessingResult | PaymentProcessingError> {
   try {
     // 1. Validate FX policy if foreign currency
-    if (input.currency !== baseCurrency) {
+    if (input.currency === baseCurrency) {
       const fxResult = validateFxPolicy(baseCurrency, input.currency);
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:72:9
 ): Promise<PaymentProcessingResult | PaymentProcessingError> {
   try {
     // 1. Validate FX policy if foreign currency
-    if (input.currency !== baseCurrency) {
+    if (true) {
       const fxResult = validateFxPolicy(baseCurrency, input.currency);
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:75:11
     if (input.currency !== baseCurrency) {
       const fxResult = validateFxPolicy(baseCurrency, input.currency);
 
-      if (fxResult.requiresFxRate) {
+      if (true) {
         // Validate that exchange rate is provided and valid
         if (input.exchangeRate === undefined || input.exchangeRate === null) {

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:75:36
     if (input.currency !== baseCurrency) {
       const fxResult = validateFxPolicy(baseCurrency, input.currency);
 
-      if (fxResult.requiresFxRate) {
-        // Validate that exchange rate is provided and valid
-        if (input.exchangeRate === undefined || input.exchangeRate === null) {
-          return {
-            success: false,
-            error: `Exchange rate required for currency conversion from ${baseCurrency} to ${input.currency}`,
-            code: "EXCHANGE_RATE_REQUIRED",
-            details: { baseCurrency, transactionCurrency: input.currency }
-          };
-        }
-
-        if (input.exchangeRate <= 0) {
-          return {
-            success: false,
-            error: `Exchange rate must be positive for currency conversion from ${baseCurrency} to ${input.currency}`,
-            code: "INVALID_EXCHANGE_RATE",
-            details: { baseCurrency, transactionCurrency: input.currency, exchangeRate: input.exchangeRate }
-          };
-        }
-      }
+      if (fxResult.requiresFxRate) {}
 
       // FX validation passed - we have the required rate info

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:77:13
 
       if (fxResult.requiresFxRate) {
         // Validate that exchange rate is provided and valid
-        if (input.exchangeRate === undefined || input.exchangeRate === null) {
+        if (false) {
           return {
             success: false,

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:77:13
 
       if (fxResult.requiresFxRate) {
         // Validate that exchange rate is provided and valid
-        if (input.exchangeRate === undefined || input.exchangeRate === null) {
+        if (false || input.exchangeRate === null) {
           return {
             success: false,

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:82:22
             success: false,
             error: `Exchange rate required for currency conversion from ${baseCurrency} to ${input.currency}`,
             code: "EXCHANGE_RATE_REQUIRED",
-            details: { baseCurrency, transactionCurrency: input.currency }
+            details: {}
           };
         }

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:86:38
           };
         }
 
-        if (input.exchangeRate <= 0) {
-          return {
-            success: false,
-            error: `Exchange rate must be positive for currency conversion from ${baseCurrency} to ${input.currency}`,
-            code: "INVALID_EXCHANGE_RATE",
-            details: { baseCurrency, transactionCurrency: input.currency, exchangeRate: input.exchangeRate }
-          };
-        }
+        if (input.exchangeRate <= 0) {}
       }
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:86:13
           };
         }
 
-        if (input.exchangeRate <= 0) {
+        if (false) {
           return {
             success: false,

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:91:22
             success: false,
             error: `Exchange rate must be positive for currency conversion from ${baseCurrency} to ${input.currency}`,
             code: "INVALID_EXCHANGE_RATE",
-            details: { baseCurrency, transactionCurrency: input.currency, exchangeRate: input.exchangeRate }
+            details: {}
           };
         }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:101:9
 
     // 2. Validate payment business rules
     const businessValidation = validatePaymentBusinessRules(input);
-    if (!businessValidation.valid) {
+    if (false) {
       return {
         success: false,

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:101:36
 
     // 2. Validate payment business rules
     const businessValidation = validatePaymentBusinessRules(input);
-    if (!businessValidation.valid) {
-      return {
-        success: false,
-        error: `Payment validation failed: ${businessValidation.errors.join(", ")}`,
-        code: "PAYMENT_VALIDATION_FAILED",
-        details: { errors: businessValidation.errors },
-      };
-    }
+    if (!businessValidation.valid) {}
 
     // 3. Build journal lines based on payment type

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:102:14
     // 2. Validate payment business rules
     const businessValidation = validatePaymentBusinessRules(input);
     if (!businessValidation.valid) {
-      return {
-        success: false,
-        error: `Payment validation failed: ${businessValidation.errors.join(", ")}`,
-        code: "PAYMENT_VALIDATION_FAILED",
-        details: { errors: businessValidation.errors },
-      };
+      return {};
     }
 

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:106:18
         success: false,
         error: `Payment validation failed: ${businessValidation.errors.join(", ")}`,
         code: "PAYMENT_VALIDATION_FAILED",
-        details: { errors: businessValidation.errors },
+        details: {},
       };
     }

[Survived] ArrayDeclaration
accounting/src/ap/payment-processing.ts:111:26
     }
 
     // 3. Build journal lines based on payment type
-    const journalLines = [];
+    const journalLines = ["Stryker was here"];
     const convertedAmount = input.amount * input.exchangeRate;
 

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:112:29
 
     // 3. Build journal lines based on payment type
     const journalLines = [];
-    const convertedAmount = input.amount * input.exchangeRate;
+    const convertedAmount = input.amount / input.exchangeRate;
 
     // Group allocations by type

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:115:59
     const convertedAmount = input.amount * input.exchangeRate;
 
     // Group allocations by type
-    const billAllocations = input.allocations.filter(a => a.type === "BILL");
+    const billAllocations = input.allocations.filter(a => false);
     const invoiceAllocations = input.allocations.filter(a => a.type === "INVOICE");
 

[Survived] MethodExpression
accounting/src/ap/payment-processing.ts:115:29
     const convertedAmount = input.amount * input.exchangeRate;
 
     // Group allocations by type
-    const billAllocations = input.allocations.filter(a => a.type === "BILL");
+    const billAllocations = input.allocations;
     const invoiceAllocations = input.allocations.filter(a => a.type === "INVOICE");
 

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:116:57
 
     // Group allocations by type
     const billAllocations = input.allocations.filter(a => a.type === "BILL");
-    const invoiceAllocations = input.allocations.filter(a => a.type === "INVOICE");
+    const invoiceAllocations = input.allocations.filter(() => undefined);
 
     // Process bill payments (outgoing payments)

[Survived] MethodExpression
accounting/src/ap/payment-processing.ts:116:32
 
     // Group allocations by type
     const billAllocations = input.allocations.filter(a => a.type === "BILL");
-    const invoiceAllocations = input.allocations.filter(a => a.type === "INVOICE");
+    const invoiceAllocations = input.allocations;
 
     // Process bill payments (outgoing payments)

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:119:9
     const invoiceAllocations = input.allocations.filter(a => a.type === "INVOICE");
 
     // Process bill payments (outgoing payments)
-    if (billAllocations.length > 0) {
+    if (billAllocations.length >= 0) {
       // Debit AP accounts for each bill allocation
       for (const allocation of billAllocations) {

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:119:9
     const invoiceAllocations = input.allocations.filter(a => a.type === "INVOICE");
 
     // Process bill payments (outgoing payments)
-    if (billAllocations.length > 0) {
+    if (true) {
       // Debit AP accounts for each bill allocation
       for (const allocation of billAllocations) {

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:121:49
     // Process bill payments (outgoing payments)
     if (billAllocations.length > 0) {
       // Debit AP accounts for each bill allocation
-      for (const allocation of billAllocations) {
-        const convertedAllocation = allocation.allocatedAmount * input.exchangeRate;
-
-        journalLines.push({
-          accountId: allocation.apAccountId!,
-          debit: convertedAllocation,
-          credit: 0,
-          description: `Payment ${input.paymentNumber} - Bill ${allocation.documentNumber}`,
-          reference: input.paymentNumber,
-        });
-      }
+      for (const allocation of billAllocations) {}
 
       // Credit bank account (total outgoing)

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:122:37
     if (billAllocations.length > 0) {
       // Debit AP accounts for each bill allocation
       for (const allocation of billAllocations) {
-        const convertedAllocation = allocation.allocatedAmount * input.exchangeRate;
+        const convertedAllocation = allocation.allocatedAmount / input.exchangeRate;
 
         journalLines.push({

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:124:27
       for (const allocation of billAllocations) {
         const convertedAllocation = allocation.allocatedAmount * input.exchangeRate;
 
-        journalLines.push({
-          accountId: allocation.apAccountId!,
-          debit: convertedAllocation,
-          credit: 0,
-          description: `Payment ${input.paymentNumber} - Bill ${allocation.documentNumber}`,
-          reference: input.paymentNumber,
-        });
+        journalLines.push({});
       }
 

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:135:9
 
       // Credit bank account (total outgoing)
       const totalBillPayments =
-        billAllocations.reduce((sum, a) => sum + a.allocatedAmount, 0) * input.exchangeRate;
+        billAllocations.reduce((sum, a) => sum + a.allocatedAmount, 0) / input.exchangeRate;
       journalLines.push({
         accountId: input.bankAccountId,

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:135:32
 
       // Credit bank account (total outgoing)
       const totalBillPayments =
-        billAllocations.reduce((sum, a) => sum + a.allocatedAmount, 0) * input.exchangeRate;
+        billAllocations.reduce(() => undefined, 0) * input.exchangeRate;
       journalLines.push({
         accountId: input.bankAccountId,

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:146:40
     }
 
     // Process invoice receipts (incoming payments)
-    if (invoiceAllocations.length > 0) {
-      // Debit bank account (total incoming)
-      const totalInvoiceReceipts =
-        invoiceAllocations.reduce((sum, a) => sum + a.allocatedAmount, 0) * input.exchangeRate;
-      journalLines.push({
-        accountId: input.bankAccountId,
-        debit: totalInvoiceReceipts,
-        credit: 0,
-        description: `Receipt ${input.paymentNumber} - ${input.paymentMethod}`,
-        reference: input.paymentNumber,
-      });
-
-      // Credit AR accounts for each invoice allocation
-      for (const allocation of invoiceAllocations) {
-        const convertedAllocation = allocation.allocatedAmount * input.exchangeRate;
-
-        journalLines.push({
-          accountId: allocation.arAccountId!,
-          debit: 0,
-          credit: convertedAllocation,
-          description: `Receipt ${input.paymentNumber} - Invoice ${allocation.documentNumber}`,
-          reference: input.paymentNumber,
-        });
-      }
-    }
+    if (invoiceAllocations.length > 0) {}
 
     // 4. Create posting context for SoD validation

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:146:9
     }
 
     // Process invoice receipts (incoming payments)
-    if (invoiceAllocations.length > 0) {
+    if (false) {
       // Debit bank account (total incoming)
       const totalInvoiceReceipts =

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:149:47
     if (invoiceAllocations.length > 0) {
       // Debit bank account (total incoming)
       const totalInvoiceReceipts =
-        invoiceAllocations.reduce((sum, a) => sum + a.allocatedAmount, 0) * input.exchangeRate;
+        invoiceAllocations.reduce((sum, a) => sum - a.allocatedAmount, 0) * input.exchangeRate;
       journalLines.push({
         accountId: input.bankAccountId,

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:149:35
     if (invoiceAllocations.length > 0) {
       // Debit bank account (total incoming)
       const totalInvoiceReceipts =
-        invoiceAllocations.reduce((sum, a) => sum + a.allocatedAmount, 0) * input.exchangeRate;
+        invoiceAllocations.reduce(() => undefined, 0) * input.exchangeRate;
       journalLines.push({
         accountId: input.bankAccountId,

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:159:52
       });
 
       // Credit AR accounts for each invoice allocation
-      for (const allocation of invoiceAllocations) {
-        const convertedAllocation = allocation.allocatedAmount * input.exchangeRate;
-
-        journalLines.push({
-          accountId: allocation.arAccountId!,
-          debit: 0,
-          credit: convertedAllocation,
-          description: `Receipt ${input.paymentNumber} - Invoice ${allocation.documentNumber}`,
-          reference: input.paymentNumber,
-        });
-      }
+      for (const allocation of invoiceAllocations) {}
     }
 

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:160:37
 
       // Credit AR accounts for each invoice allocation
       for (const allocation of invoiceAllocations) {
-        const convertedAllocation = allocation.allocatedAmount * input.exchangeRate;
+        const convertedAllocation = allocation.allocatedAmount / input.exchangeRate;
 
         journalLines.push({

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:166:24
           accountId: allocation.arAccountId!,
           debit: 0,
           credit: convertedAllocation,
-          description: `Receipt ${input.paymentNumber} - Invoice ${allocation.documentNumber}`,
+          description: ``,
           reference: input.paymentNumber,
         });

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:173:37
     }
 
     // 4. Create posting context for SoD validation
-    const context: PostingContext = {
-      tenantId: input.tenantId,
-      companyId: input.companyId,
-      userId,
-      userRole,
-    };
+    const context: PostingContext = {};
 
     // 5. Prepare journal posting input

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:181:47
     };
 
     // 5. Prepare journal posting input
-    const journalInput: JournalPostingInput = {
-      context,
-      journalNumber: `PAY-${input.paymentNumber}`,
-      description: input.description || `Payment ${input.paymentNumber} - ${input.paymentMethod}`,
-      journalDate: new Date(input.paymentDate),
-      currency: baseCurrency, // Always post in base currency
-      lines: journalLines,
-    };
+    const journalInput: JournalPostingInput = {};
 
     // 6. Validate journal posting (includes SoD, COA, balance checks)

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:184:20
     const journalInput: JournalPostingInput = {
       context,
       journalNumber: `PAY-${input.paymentNumber}`,
-      description: input.description || `Payment ${input.paymentNumber} - ${input.paymentMethod}`,
+      description: false,
       journalDate: new Date(input.paymentDate),
       currency: baseCurrency, // Always post in base currency

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:184:20
     const journalInput: JournalPostingInput = {
       context,
       journalNumber: `PAY-${input.paymentNumber}`,
-      description: input.description || `Payment ${input.paymentNumber} - ${input.paymentMethod}`,
+      description: true,
       journalDate: new Date(input.paymentDate),
       currency: baseCurrency, // Always post in base currency

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:193:9
     // 6. Validate journal posting (includes SoD, COA, balance checks)
     const validation = await validateJournalPosting(journalInput);
 
-    if (!validation.validated) {
+    if (false) {
       return {
         success: false,

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:193:32
     // 6. Validate journal posting (includes SoD, COA, balance checks)
     const validation = await validateJournalPosting(journalInput);
 
-    if (!validation.validated) {
-      return {
-        success: false,
-        error: "Journal validation failed",
-        code: "JOURNAL_VALIDATION_FAILED",
-        details: validation,
-      };
-    }
+    if (!validation.validated) {}
 
     // 7. Return successful validation result

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:203:12
     }
 
     // 7. Return successful validation result
-    return {
-      success: true,
-      journalId: "", // Will be set when actually posted
-      journalNumber: journalInput.journalNumber,
-      totalAmount: convertedAmount,
-      allocationsProcessed: input.allocations.length,
-      lines: journalLines.map(line => ({
-        accountId: line.accountId,
-        debit: line.debit,
-        credit: line.credit,
-        description: line.description,
-      })),
-    };
+    return {};
   } catch (error) {
     return {

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:205:18
     // 7. Return successful validation result
     return {
       success: true,
-      journalId: "", // Will be set when actually posted
+      journalId: "Stryker was here!", // Will be set when actually posted
       journalNumber: journalInput.journalNumber,
       totalAmount: convertedAmount,

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:209:31
       journalNumber: journalInput.journalNumber,
       totalAmount: convertedAmount,
       allocationsProcessed: input.allocations.length,
-      lines: journalLines.map(line => ({
-        accountId: line.accountId,
-        debit: line.debit,
-        credit: line.credit,
-        description: line.description,
-      })),
+      lines: journalLines.map(() => undefined),
     };
   } catch (error) {

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:216:19
         description: line.description,
       })),
     };
-  } catch (error) {
-    return {
-      success: false,
-      error: error instanceof Error ? error.message : "Unknown error occurred",
-      code: "PAYMENT_PROCESSING_ERROR",
-      details: error as Record<string, unknown>,
-    };
-  }
+  } catch (error) {}
 }
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:237:7
 
   // Validate payment date is not in the future
   const paymentDate = new Date(input.paymentDate);
-  if (paymentDate > new Date()) {
+  if (true) {
     errors.push("Payment date cannot be in the future");
   }

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:237:7
 
   // Validate payment date is not in the future
   const paymentDate = new Date(input.paymentDate);
-  if (paymentDate > new Date()) {
+  if (paymentDate <= new Date()) {
     errors.push("Payment date cannot be in the future");
   }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:242:7
   }
 
   // Validate currency format
-  if (!input.currency || input.currency.length !== 3) {
+  if (false) {
     errors.push("Currency must be a valid 3-letter ISO code");
   }

[Survived] LogicalOperator
accounting/src/ap/payment-processing.ts:242:7
   }
 
   // Validate currency format
-  if (!input.currency || input.currency.length !== 3) {
+  if (!input.currency && input.currency.length !== 3) {
     errors.push("Currency must be a valid 3-letter ISO code");
   }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:247:7
   }
 
   // Validate exchange rate
-  if (input.exchangeRate <= 0) {
+  if (true) {
     errors.push("Exchange rate must be positive");
   }

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:247:7
   }
 
   // Validate exchange rate
-  if (input.exchangeRate <= 0) {
+  if (input.exchangeRate < 0) {
     errors.push("Exchange rate must be positive");
   }

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:248:17
 
   // Validate exchange rate
   if (input.exchangeRate <= 0) {
-    errors.push("Exchange rate must be positive");
+    errors.push("");
   }
 

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:252:26
   }
 
   // Validate amount
-  if (input.amount <= 0) {
-    errors.push("Payment amount must be positive");
-  }
+  if (input.amount <= 0) {}
 
   // Validate payment method

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:252:7
   }
 
   // Validate amount
-  if (input.amount <= 0) {
+  if (false) {
     errors.push("Payment amount must be positive");
   }

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:253:17
 
   // Validate amount
   if (input.amount <= 0) {
-    errors.push("Payment amount must be positive");
+    errors.push("");
   }
 

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:257:51
   }
 
   // Validate payment method
-  const validMethods = ["BANK_TRANSFER", "CHECK", "CASH", "CREDIT_CARD", "DEBIT_CARD", "OTHER"];
+  const validMethods = ["BANK_TRANSFER", "CHECK", "", "CREDIT_CARD", "DEBIT_CARD", "OTHER"];
   if (!validMethods.includes(input.paymentMethod)) {
     errors.push("Invalid payment method");

[Survived] BooleanLiteral
accounting/src/ap/payment-processing.ts:258:7
 
   // Validate payment method
   const validMethods = ["BANK_TRANSFER", "CHECK", "CASH", "CREDIT_CARD", "DEBIT_CARD", "OTHER"];
-  if (!validMethods.includes(input.paymentMethod)) {
+  if (validMethods.includes(input.paymentMethod)) {
     errors.push("Invalid payment method");
   }

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:258:52
 
   // Validate payment method
   const validMethods = ["BANK_TRANSFER", "CHECK", "CASH", "CREDIT_CARD", "DEBIT_CARD", "OTHER"];
-  if (!validMethods.includes(input.paymentMethod)) {
-    errors.push("Invalid payment method");
-  }
+  if (!validMethods.includes(input.paymentMethod)) {}
 
   // Validate allocations exist

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:263:29
   }
 
   // Validate allocations exist
-  if (!input.allocations || input.allocations.length === 0) {
+  if (!input.allocations || input.allocations.length !== 0) {
     errors.push("Payment must have at least one allocation");
   }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:263:7
   }
 
   // Validate allocations exist
-  if (!input.allocations || input.allocations.length === 0) {
+  if (false) {
     errors.push("Payment must have at least one allocation");
   }

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:264:17
 
   // Validate allocations exist
   if (!input.allocations || input.allocations.length === 0) {
-    errors.push("Payment must have at least one allocation");
+    errors.push("");
   }
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:268:7
   }
 
   // Validate allocation totals match payment amount
-  if (input.allocations) {
+  if (false) {
     const totalAllocated = input.allocations.reduce((sum, a) => sum + a.allocatedAmount, 0);
     if (Math.abs(totalAllocated - input.amount) > 0.01) {

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:268:7
   }
 
   // Validate allocation totals match payment amount
-  if (input.allocations) {
+  if (true) {
     const totalAllocated = input.allocations.reduce((sum, a) => sum + a.allocatedAmount, 0);
     if (Math.abs(totalAllocated - input.amount) > 0.01) {

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:269:53
 
   // Validate allocation totals match payment amount
   if (input.allocations) {
-    const totalAllocated = input.allocations.reduce((sum, a) => sum + a.allocatedAmount, 0);
+    const totalAllocated = input.allocations.reduce(() => undefined, 0);
     if (Math.abs(totalAllocated - input.amount) > 0.01) {
       errors.push(

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:269:65
 
   // Validate allocation totals match payment amount
   if (input.allocations) {
-    const totalAllocated = input.allocations.reduce((sum, a) => sum + a.allocatedAmount, 0);
+    const totalAllocated = input.allocations.reduce((sum, a) => sum - a.allocatedAmount, 0);
     if (Math.abs(totalAllocated - input.amount) > 0.01) {
       errors.push(

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:270:9
   // Validate allocation totals match payment amount
   if (input.allocations) {
     const totalAllocated = input.allocations.reduce((sum, a) => sum + a.allocatedAmount, 0);
-    if (Math.abs(totalAllocated - input.amount) > 0.01) {
+    if (Math.abs(totalAllocated - input.amount) <= 0.01) {
       errors.push(
         `Total allocated amount (${totalAllocated}) does not match payment amount (${input.amount})`,

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:270:9
   // Validate allocation totals match payment amount
   if (input.allocations) {
     const totalAllocated = input.allocations.reduce((sum, a) => sum + a.allocatedAmount, 0);
-    if (Math.abs(totalAllocated - input.amount) > 0.01) {
+    if (true) {
       errors.push(
         `Total allocated amount (${totalAllocated}) does not match payment amount (${input.amount})`,

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:277:21
     }
 
     // Validate each allocation
-    for (let i = 0; i < input.allocations.length; i++) {
+    for (let i = 0; false; i++) {
       const allocation = input.allocations[i];
 

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:277:21
     }
 
     // Validate each allocation
-    for (let i = 0; i < input.allocations.length; i++) {
+    for (let i = 0; i >= input.allocations.length; i++) {
       const allocation = input.allocations[i];
 

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:280:52
     for (let i = 0; i < input.allocations.length; i++) {
       const allocation = input.allocations[i];
 
-      if ((allocation?.allocatedAmount || 0) <= 0) {
-        errors.push(`Allocation ${i + 1}: Amount must be positive`);
-      }
+      if ((allocation?.allocatedAmount || 0) <= 0) {}
 
       if (allocation?.type === "BILL" && !allocation.apAccountId) {

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:280:11
     for (let i = 0; i < input.allocations.length; i++) {
       const allocation = input.allocations[i];
 
-      if ((allocation?.allocatedAmount || 0) <= 0) {
+      if ((allocation?.allocatedAmount || 0) < 0) {
         errors.push(`Allocation ${i + 1}: Amount must be positive`);
       }

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:281:35
       const allocation = input.allocations[i];
 
       if ((allocation?.allocatedAmount || 0) <= 0) {
-        errors.push(`Allocation ${i + 1}: Amount must be positive`);
+        errors.push(`Allocation ${i - 1}: Amount must be positive`);
       }
 

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:284:67
         errors.push(`Allocation ${i + 1}: Amount must be positive`);
       }
 
-      if (allocation?.type === "BILL" && !allocation.apAccountId) {
-        errors.push(`Allocation ${i + 1}: AP account required for bill payments`);
-      }
+      if (allocation?.type === "BILL" && !allocation.apAccountId) {}
 
       if (allocation?.type === "INVOICE" && !allocation.arAccountId) {

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:284:11
         errors.push(`Allocation ${i + 1}: Amount must be positive`);
       }
 
-      if (allocation?.type === "BILL" && !allocation.apAccountId) {
+      if (true) {
         errors.push(`Allocation ${i + 1}: AP account required for bill payments`);
       }

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:285:35
       }
 
       if (allocation?.type === "BILL" && !allocation.apAccountId) {
-        errors.push(`Allocation ${i + 1}: AP account required for bill payments`);
+        errors.push(`Allocation ${i - 1}: AP account required for bill payments`);
       }
 
