[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:288:70
         errors.push(`Allocation ${i + 1}: AP account required for bill payments`);
       }
 
-      if (allocation?.type === "INVOICE" && !allocation.arAccountId) {
-        errors.push(`Allocation ${i + 1}: AR account required for invoice receipts`);
-      }
+      if (allocation?.type === "INVOICE" && !allocation.arAccountId) {}
 
       if (allocation?.type === "BILL" && !allocation.supplierId) {

[Survived] OptionalChaining
accounting/src/ap/payment-processing.ts:288:11
         errors.push(`Allocation ${i + 1}: AP account required for bill payments`);
       }
 
-      if (allocation?.type === "INVOICE" && !allocation.arAccountId) {
+      if (allocation.type === "INVOICE" && !allocation.arAccountId) {
         errors.push(`Allocation ${i + 1}: AR account required for invoice receipts`);
       }

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:289:35
       }
 
       if (allocation?.type === "INVOICE" && !allocation.arAccountId) {
-        errors.push(`Allocation ${i + 1}: AR account required for invoice receipts`);
+        errors.push(`Allocation ${i - 1}: AR account required for invoice receipts`);
       }
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:292:11
         errors.push(`Allocation ${i + 1}: AR account required for invoice receipts`);
       }
 
-      if (allocation?.type === "BILL" && !allocation.supplierId) {
+      if (false) {
         errors.push(`Allocation ${i + 1}: Supplier ID required for bill payments`);
       }

[Survived] OptionalChaining
accounting/src/ap/payment-processing.ts:292:11
         errors.push(`Allocation ${i + 1}: AR account required for invoice receipts`);
       }
 
-      if (allocation?.type === "BILL" && !allocation.supplierId) {
+      if (allocation.type === "BILL" && !allocation.supplierId) {
         errors.push(`Allocation ${i + 1}: Supplier ID required for bill payments`);
       }

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:293:35
       }
 
       if (allocation?.type === "BILL" && !allocation.supplierId) {
-        errors.push(`Allocation ${i + 1}: Supplier ID required for bill payments`);
+        errors.push(`Allocation ${i - 1}: Supplier ID required for bill payments`);
       }
 

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:296:11
         errors.push(`Allocation ${i + 1}: Supplier ID required for bill payments`);
       }
 
-      if (allocation?.type === "INVOICE" && !allocation.customerId) {
+      if (allocation?.type !== "INVOICE" && !allocation.customerId) {
         errors.push(`Allocation ${i + 1}: Customer ID required for invoice receipts`);
       }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:296:11
         errors.push(`Allocation ${i + 1}: Supplier ID required for bill payments`);
       }
 
-      if (allocation?.type === "INVOICE" && !allocation.customerId) {
+      if (false) {
         errors.push(`Allocation ${i + 1}: Customer ID required for invoice receipts`);
       }

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:297:35
       }
 
       if (allocation?.type === "INVOICE" && !allocation.customerId) {
-        errors.push(`Allocation ${i + 1}: Customer ID required for invoice receipts`);
+        errors.push(`Allocation ${i - 1}: Customer ID required for invoice receipts`);
       }
     }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:303:12
   }
 
   return {
-    valid: errors.length === 0,
+    valid: true,
     errors,
   };

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:303:12
   }
 
   return {
-    valid: errors.length === 0,
+    valid: errors.length !== 0,
     errors,
   };

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:314:24
 export function generatePaymentNumber(
   companyCode: string,
   sequence: number,
-  type: "OUT" | "IN" = "OUT",
+  type: "OUT" | "IN" = "",
 ): string {
   const year = new Date().getFullYear();

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:315:11
   companyCode: string,
   sequence: number,
   type: "OUT" | "IN" = "OUT",
-): string {
-  const year = new Date().getFullYear();
-  const paddedSequence = sequence.toString().padStart(6, "0");
-  const prefix = type === "OUT" ? "PAY" : "REC";
-  return `${prefix}-${companyCode}-${year}-${paddedSequence}`;
-}
+): string {}
 
 /**

[Survived] StringLiteral
accounting/src/ap/payment-processing.ts:317:58
   type: "OUT" | "IN" = "OUT",
 ): string {
   const year = new Date().getFullYear();
-  const paddedSequence = sequence.toString().padStart(6, "0");
+  const paddedSequence = sequence.toString().padStart(6, "");
   const prefix = type === "OUT" ? "PAY" : "REC";
   return `${prefix}-${companyCode}-${year}-${paddedSequence}`;

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:318:18
 ): string {
   const year = new Date().getFullYear();
   const paddedSequence = sequence.toString().padStart(6, "0");
-  const prefix = type === "OUT" ? "PAY" : "REC";
+  const prefix = false ? "PAY" : "REC";
   return `${prefix}-${companyCode}-${year}-${paddedSequence}`;
 }

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:318:18
 ): string {
   const year = new Date().getFullYear();
   const paddedSequence = sequence.toString().padStart(6, "0");
-  const prefix = type === "OUT" ? "PAY" : "REC";
+  const prefix = type !== "OUT" ? "PAY" : "REC";
   return `${prefix}-${companyCode}-${year}-${paddedSequence}`;
 }

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:329:3
   billPayments: number;
   invoiceReceipts: number;
   totalAmount: number;
-} {
-  const billPayments = allocations
-    .filter(a => a.type === "BILL")
-    .reduce((sum, a) => sum + a.allocatedAmount, 0);
-
-  const invoiceReceipts = allocations
-    .filter(a => a.type === "INVOICE")
-    .reduce((sum, a) => sum + a.allocatedAmount, 0);
-
-  return {
-    billPayments: Math.round(billPayments * 100) / 100,
-    invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
-    totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,
-  };
-}
+} {}
 
 /**

[Survived] MethodExpression
accounting/src/ap/payment-processing.ts:330:24
   invoiceReceipts: number;
   totalAmount: number;
 } {
-  const billPayments = allocations
-    .filter(a => a.type === "BILL")
+  const billPayments = allocations
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:331:18
   totalAmount: number;
 } {
   const billPayments = allocations
-    .filter(a => a.type === "BILL")
+    .filter(a => true)
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:331:13
   totalAmount: number;
 } {
   const billPayments = allocations
-    .filter(a => a.type === "BILL")
+    .filter(() => undefined)
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:332:25
 } {
   const billPayments = allocations
     .filter(a => a.type === "BILL")
-    .reduce((sum, a) => sum + a.allocatedAmount, 0);
+    .reduce((sum, a) => sum - a.allocatedAmount, 0);
 
   const invoiceReceipts = allocations

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:332:13
 } {
   const billPayments = allocations
     .filter(a => a.type === "BILL")
-    .reduce((sum, a) => sum + a.allocatedAmount, 0);
+    .reduce(() => undefined, 0);
 
   const invoiceReceipts = allocations

[Survived] MethodExpression
accounting/src/ap/payment-processing.ts:334:27
     .filter(a => a.type === "BILL")
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 
-  const invoiceReceipts = allocations
-    .filter(a => a.type === "INVOICE")
+  const invoiceReceipts = allocations
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:335:18
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 
   const invoiceReceipts = allocations
-    .filter(a => a.type === "INVOICE")
+    .filter(a => a.type !== "INVOICE")
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:335:18
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 
   const invoiceReceipts = allocations
-    .filter(a => a.type === "INVOICE")
+    .filter(a => true)
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:336:25
 
   const invoiceReceipts = allocations
     .filter(a => a.type === "INVOICE")
-    .reduce((sum, a) => sum + a.allocatedAmount, 0);
+    .reduce((sum, a) => sum - a.allocatedAmount, 0);
 
   return {

[Survived] ArrowFunction
accounting/src/ap/payment-processing.ts:336:13
 
   const invoiceReceipts = allocations
     .filter(a => a.type === "INVOICE")
-    .reduce((sum, a) => sum + a.allocatedAmount, 0);
+    .reduce(() => undefined, 0);
 
   return {

[Survived] ObjectLiteral
accounting/src/ap/payment-processing.ts:338:10
     .filter(a => a.type === "INVOICE")
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 
-  return {
-    billPayments: Math.round(billPayments * 100) / 100,
-    invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
-    totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,
-  };
+  return {};
 }
 

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:339:19
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 
   return {
-    billPayments: Math.round(billPayments * 100) / 100,
+    billPayments: Math.round(billPayments * 100) * 100,
     invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
     totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:339:30
     .reduce((sum, a) => sum + a.allocatedAmount, 0);
 
   return {
-    billPayments: Math.round(billPayments * 100) / 100,
+    billPayments: Math.round(billPayments / 100) / 100,
     invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
     totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:340:33
 
   return {
     billPayments: Math.round(billPayments * 100) / 100,
-    invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
+    invoiceReceipts: Math.round(invoiceReceipts / 100) / 100,
     totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,
   };

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:340:22
 
   return {
     billPayments: Math.round(billPayments * 100) / 100,
-    invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
+    invoiceReceipts: Math.round(invoiceReceipts * 100) * 100,
     totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,
   };

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:341:29
   return {
     billPayments: Math.round(billPayments * 100) / 100,
     invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
-    totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,
+    totalAmount: Math.round((billPayments + invoiceReceipts) / 100) / 100,
   };
 }

[Survived] ArithmeticOperator
accounting/src/ap/payment-processing.ts:341:30
   return {
     billPayments: Math.round(billPayments * 100) / 100,
     invoiceReceipts: Math.round(invoiceReceipts * 100) / 100,
-    totalAmount: Math.round((billPayments + invoiceReceipts) * 100) / 100,
+    totalAmount: Math.round((billPayments - invoiceReceipts) * 100) / 100,
   };
 }

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:355:3
   valid: boolean;
   errors: string[];
   warnings: string[];
-} {
-  const errors: string[] = [];
-  const warnings: string[] = [];
-
-  for (const allocation of allocations) {
-    const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
-
-    if (allocation.allocatedAmount > outstandingBalance) {
-      if (outstandingBalance === 0) {
-        errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);
-      } else {
-        warnings.push(
-          `Document ${allocation.documentNumber}: Allocated amount (${allocation.allocatedAmount}) exceeds outstanding balance (${outstandingBalance})`,
-        );
-      }
-    }
-  }
-
-  return {
-    valid: errors.length === 0,
-    errors,
-    warnings,
-  };
-}
+} {}
 

[Survived] ArrayDeclaration
accounting/src/ap/payment-processing.ts:357:30
   warnings: string[];
 } {
   const errors: string[] = [];
-  const warnings: string[] = [];
+  const warnings: string[] = ["Stryker was here"];
 
   for (const allocation of allocations) {

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:359:41
   const errors: string[] = [];
   const warnings: string[] = [];
 
-  for (const allocation of allocations) {
-    const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
-
-    if (allocation.allocatedAmount > outstandingBalance) {
-      if (outstandingBalance === 0) {
-        errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);
-      } else {
-        warnings.push(
-          `Document ${allocation.documentNumber}: Allocated amount (${allocation.allocatedAmount}) exceeds outstanding balance (${outstandingBalance})`,
-        );
-      }
-    }
-  }
+  for (const allocation of allocations) {}
 
   return {

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:360:32
   const warnings: string[] = [];
 
   for (const allocation of allocations) {
-    const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
+    const outstandingBalance = true;
 
     if (allocation.allocatedAmount > outstandingBalance) {

[Survived] LogicalOperator
accounting/src/ap/payment-processing.ts:360:32
   const warnings: string[] = [];
 
   for (const allocation of allocations) {
-    const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
+    const outstandingBalance = outstandingBalances.get(allocation.documentId) && 0;
 
     if (allocation.allocatedAmount > outstandingBalance) {

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:362:9
   for (const allocation of allocations) {
     const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
 
-    if (allocation.allocatedAmount > outstandingBalance) {
+    if (allocation.allocatedAmount <= outstandingBalance) {
       if (outstandingBalance === 0) {
         errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:362:9
   for (const allocation of allocations) {
     const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
 
-    if (allocation.allocatedAmount > outstandingBalance) {
+    if (false) {
       if (outstandingBalance === 0) {
         errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);

[Survived] EqualityOperator
accounting/src/ap/payment-processing.ts:363:11
     const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
 
     if (allocation.allocatedAmount > outstandingBalance) {
-      if (outstandingBalance === 0) {
+      if (outstandingBalance !== 0) {
         errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);
       } else {

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:363:11
     const outstandingBalance = outstandingBalances.get(allocation.documentId) || 0;
 
     if (allocation.allocatedAmount > outstandingBalance) {
-      if (outstandingBalance === 0) {
+      if (true) {
         errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);
       } else {

[Survived] BlockStatement
accounting/src/ap/payment-processing.ts:365:14
     if (allocation.allocatedAmount > outstandingBalance) {
       if (outstandingBalance === 0) {
         errors.push(`Document ${allocation.documentNumber} has no outstanding balance`);
-      } else {
-        warnings.push(
-          `Document ${allocation.documentNumber}: Allocated amount (${allocation.allocatedAmount}) exceeds outstanding balance (${outstandingBalance})`,
-        );
-      }
+      } else {}
     }
   }

[Survived] ConditionalExpression
accounting/src/ap/payment-processing.ts:374:12
   }
 
   return {
-    valid: errors.length === 0,
+    valid: false,
     errors,
     warnings,
