[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:77:72
 ): Promise<InvoicePostingResult | InvoicePostingError> {
   try {
     // 1. Validate basic input
-    if (!input.invoiceId || !input.arAccountId || !input.lines.length) {
-      return {
-        validated: false,
-        error: "Missing required fields: invoiceId, arAccountId, or lines",
-        code: "INVALID_AMOUNTS",
-      };
-    }
+    if (!input.invoiceId || !input.arAccountId || !input.lines.length) {}
 
     // 2. Calculate totals from lines

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:77:9
 ): Promise<InvoicePostingResult | InvoicePostingError> {
   try {
     // 1. Validate basic input
-    if (!input.invoiceId || !input.arAccountId || !input.lines.length) {
+    if (false) {
       return {
         validated: false,

[Survived] BooleanLiteral
accounting/src/ar/invoice-posting.ts:79:20
     // 1. Validate basic input
     if (!input.invoiceId || !input.arAccountId || !input.lines.length) {
       return {
-        validated: false,
+        validated: true,
         error: "Missing required fields: invoiceId, arAccountId, or lines",
         code: "INVALID_AMOUNTS",

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:86:60
     }
 
     // 2. Calculate totals from lines
-    const totalRevenue = input.lines.reduce((sum, line) => sum + line.lineAmount, 0);
+    const totalRevenue = input.lines.reduce((sum, line) => sum - line.lineAmount, 0);
     const totalTax =
       input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +

[Survived] ArrowFunction
accounting/src/ar/invoice-posting.ts:86:45
     }
 
     // 2. Calculate totals from lines
-    const totalRevenue = input.lines.reduce((sum, line) => sum + line.lineAmount, 0);
+    const totalRevenue = input.lines.reduce(() => undefined, 0);
     const totalTax =
       input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:88:41
     // 2. Calculate totals from lines
     const totalRevenue = input.lines.reduce((sum, line) => sum + line.lineAmount, 0);
     const totalTax =
-      input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +
+      input.lines.reduce((sum, line) => sum - (line.taxAmount || 0), 0) +
       (input.taxLines?.reduce((sum, tax) => sum + tax.taxAmount, 0) || 0);
     const totalAmount = totalRevenue + totalTax;

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:88:48
     // 2. Calculate totals from lines
     const totalRevenue = input.lines.reduce((sum, line) => sum + line.lineAmount, 0);
     const totalTax =
-      input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +
+      input.lines.reduce((sum, line) => sum + (false), 0) +
       (input.taxLines?.reduce((sum, tax) => sum + tax.taxAmount, 0) || 0);
     const totalAmount = totalRevenue + totalTax;

[Survived] ArrowFunction
accounting/src/ar/invoice-posting.ts:89:31
     const totalRevenue = input.lines.reduce((sum, line) => sum + line.lineAmount, 0);
     const totalTax =
       input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +
-      (input.taxLines?.reduce((sum, tax) => sum + tax.taxAmount, 0) || 0);
+      (input.taxLines?.reduce(() => undefined, 0) || 0);
     const totalAmount = totalRevenue + totalTax;
 

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:89:8
     const totalRevenue = input.lines.reduce((sum, line) => sum + line.lineAmount, 0);
     const totalTax =
       input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +
-      (input.taxLines?.reduce((sum, tax) => sum + tax.taxAmount, 0) || 0);
+      (false);
     const totalAmount = totalRevenue + totalTax;
 

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:90:25
     const totalTax =
       input.lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0) +
       (input.taxLines?.reduce((sum, tax) => sum + tax.taxAmount, 0) || 0);
-    const totalAmount = totalRevenue + totalTax;
+    const totalAmount = totalRevenue - totalTax;
 
     // 3. Validate amounts are positive

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:93:9
     const totalAmount = totalRevenue + totalTax;
 
     // 3. Validate amounts are positive
-    if (totalRevenue <= 0) {
+    if (totalRevenue > 0) {
       return {
         validated: false,

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:93:9
     const totalAmount = totalRevenue + totalTax;
 
     // 3. Validate amounts are positive
-    if (totalRevenue <= 0) {
+    if (false) {
       return {
         validated: false,

[Survived] StringLiteral
accounting/src/ar/invoice-posting.ts:96:16
     if (totalRevenue <= 0) {
       return {
         validated: false,
-        error: "Invoice revenue must be positive",
+        error: "",
         code: "INVALID_AMOUNTS",
       };

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:101:9
       };
     }
 
-    if (totalAmount <= 0) {
+    if (false) {
       return {
         validated: false,

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:101:27
       };
     }
 
-    if (totalAmount <= 0) {
-      return {
-        validated: false,
-        error: "Invoice total amount must be positive",
-        code: "INVALID_AMOUNTS",
-      };
-    }
+    if (totalAmount <= 0) {}
 
     // 4. Validate currency and FX policy

[Survived] ObjectLiteral
accounting/src/ar/invoice-posting.ts:102:14
     }
 
     if (totalAmount <= 0) {
-      return {
-        validated: false,
-        error: "Invoice total amount must be positive",
-        code: "INVALID_AMOUNTS",
-      };
+      return {};
     }
 

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:113:64
     const fxValidation = validateFxPolicy(baseCurrency, input.currency);
     const exchangeRate = fxValidation.requiresFxRate ? input.exchangeRate : 1.0;
 
-    if (fxValidation.requiresFxRate && (!input.exchangeRate || input.exchangeRate <= 0)) {
+    if (fxValidation.requiresFxRate && (!input.exchangeRate || input.exchangeRate > 0)) {
       return {
         validated: false,

[Survived] LogicalOperator
accounting/src/ar/invoice-posting.ts:113:9
     const fxValidation = validateFxPolicy(baseCurrency, input.currency);
     const exchangeRate = fxValidation.requiresFxRate ? input.exchangeRate : 1.0;
 
-    if (fxValidation.requiresFxRate && (!input.exchangeRate || input.exchangeRate <= 0)) {
+    if (fxValidation.requiresFxRate || !input.exchangeRate || input.exchangeRate <= 0) {
       return {
         validated: false,

[Survived] StringLiteral
accounting/src/ar/invoice-posting.ts:117:15
       return {
         validated: false,
         error: `Exchange rate required for ${input.currency} to ${baseCurrency} conversion`,
-        code: "INVALID_CURRENCY",
+        code: "",
       };
     }

[Survived] ArrayDeclaration
accounting/src/ar/invoice-posting.ts:128:10
       credit: number;
       description: string;
       reference?: string;
-    }> = [];
+    }> = ["Stryker was here"];
 
     // Debit: Accounts Receivable (total amount in base currency)

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:131:26
     }> = [];
 
     // Debit: Accounts Receivable (total amount in base currency)
-    const arAmountBase = totalAmount * exchangeRate;
+    const arAmountBase = totalAmount / exchangeRate;
     journalLines.push({
       accountId: input.arAccountId,

[Survived] ObjectLiteral
accounting/src/ar/invoice-posting.ts:132:23
 
     // Debit: Accounts Receivable (total amount in base currency)
     const arAmountBase = totalAmount * exchangeRate;
-    journalLines.push({
-      accountId: input.arAccountId,
-      debit: arAmountBase,
-      credit: 0,
-      description: `AR - ${input.customerName} - ${input.invoiceNumber}`,
-      reference: input.invoiceNumber,
-    });
+    journalLines.push({});
 
     // Credit: Revenue accounts (line amounts in base currency)

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:141:37
     });
 
     // Credit: Revenue accounts (line amounts in base currency)
-    for (const line of input.lines) {
-      const revenueAmountBase = line.lineAmount * exchangeRate;
-      journalLines.push({
-        accountId: line.revenueAccountId,
-        debit: 0,
-        credit: revenueAmountBase,
-        description: `Revenue - ${line.description}`,
-        reference: input.invoiceNumber,
-      });
-
-      // Credit: Tax amount if applicable
-      if (line.taxAmount && line.taxAmount > 0 && line.taxCode) {
-        // Note: Tax account ID would need to be resolved from tax code
-        // For now, we'll handle this in the service layer
-      }
-    }
+    for (const line of input.lines) {}
 
     // Credit: Tax lines (if any)

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:142:33
 
     // Credit: Revenue accounts (line amounts in base currency)
     for (const line of input.lines) {
-      const revenueAmountBase = line.lineAmount * exchangeRate;
+      const revenueAmountBase = line.lineAmount / exchangeRate;
       journalLines.push({
         accountId: line.revenueAccountId,

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:152:29
       });
 
       // Credit: Tax amount if applicable
-      if (line.taxAmount && line.taxAmount > 0 && line.taxCode) {
+      if (line.taxAmount && line.taxAmount <= 0 && line.taxCode) {
         // Note: Tax account ID would need to be resolved from tax code
         // For now, we'll handle this in the service layer

[Survived] LogicalOperator
accounting/src/ar/invoice-posting.ts:152:11
       });
 
       // Credit: Tax amount if applicable
-      if (line.taxAmount && line.taxAmount > 0 && line.taxCode) {
+      if (line.taxAmount || line.taxAmount > 0 && line.taxCode) {
         // Note: Tax account ID would need to be resolved from tax code
         // For now, we'll handle this in the service layer

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:159:25
     }
 
     // Credit: Tax lines (if any)
-    if (input.taxLines) {
-      for (const taxLine of input.taxLines) {
-        const taxAmountBase = taxLine.taxAmount * exchangeRate;
-        journalLines.push({
-          accountId: taxLine.taxAccountId,
-          debit: 0,
-          credit: taxAmountBase,
-          description: `${taxLine.taxCode} Tax - ${input.invoiceNumber}`,
-          reference: input.invoiceNumber,
-        });
-      }
-    }
+    if (input.taxLines) {}
 
     // 6. Create journal posting input

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:159:9
     }
 
     // Credit: Tax lines (if any)
-    if (input.taxLines) {
+    if (true) {
       for (const taxLine of input.taxLines) {
         const taxAmountBase = taxLine.taxAmount * exchangeRate;

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:160:45
 
     // Credit: Tax lines (if any)
     if (input.taxLines) {
-      for (const taxLine of input.taxLines) {
-        const taxAmountBase = taxLine.taxAmount * exchangeRate;
-        journalLines.push({
-          accountId: taxLine.taxAccountId,
-          debit: 0,
-          credit: taxAmountBase,
-          description: `${taxLine.taxCode} Tax - ${input.invoiceNumber}`,
-          reference: input.invoiceNumber,
-        });
-      }
+      for (const taxLine of input.taxLines) {}
     }
 

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:161:31
     // Credit: Tax lines (if any)
     if (input.taxLines) {
       for (const taxLine of input.taxLines) {
-        const taxAmountBase = taxLine.taxAmount * exchangeRate;
+        const taxAmountBase = taxLine.taxAmount / exchangeRate;
         journalLines.push({
           accountId: taxLine.taxAccountId,

[Survived] ObjectLiteral
accounting/src/ar/invoice-posting.ts:162:27
     if (input.taxLines) {
       for (const taxLine of input.taxLines) {
         const taxAmountBase = taxLine.taxAmount * exchangeRate;
-        journalLines.push({
-          accountId: taxLine.taxAccountId,
-          debit: 0,
-          credit: taxAmountBase,
-          description: `${taxLine.taxCode} Tax - ${input.invoiceNumber}`,
-          reference: input.invoiceNumber,
-        });
+        journalLines.push({});
       }
     }

[Survived] StringLiteral
accounting/src/ar/invoice-posting.ts:166:24
           accountId: taxLine.taxAccountId,
           debit: 0,
           credit: taxAmountBase,
-          description: `${taxLine.taxCode} Tax - ${input.invoiceNumber}`,
+          description: ``,
           reference: input.invoiceNumber,
         });

[Survived] ObjectLiteral
accounting/src/ar/invoice-posting.ts:173:47
     }
 
     // 6. Create journal posting input
-    const journalInput: JournalPostingInput = {
-      journalNumber: input.invoiceNumber, // Use invoice number as journal number
-      description: input.description || `Invoice ${input.invoiceNumber} - ${input.customerName}`,
-      journalDate: new Date(input.invoiceDate), // Convert string to Date
-      currency: baseCurrency, // Always post in base currency
-      lines: journalLines,
-      context: {
-        tenantId: input.tenantId,
-        companyId: input.companyId,
-        userId,
-        userRole,
-      },
-    };
+    const journalInput: JournalPostingInput = {};
 
     // 7. Validate the journal posting

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:175:20
     // 6. Create journal posting input
     const journalInput: JournalPostingInput = {
       journalNumber: input.invoiceNumber, // Use invoice number as journal number
-      description: input.description || `Invoice ${input.invoiceNumber} - ${input.customerName}`,
+      description: true,
       journalDate: new Date(input.invoiceDate), // Convert string to Date
       currency: baseCurrency, // Always post in base currency

[Survived] LogicalOperator
accounting/src/ar/invoice-posting.ts:175:20
     // 6. Create journal posting input
     const journalInput: JournalPostingInput = {
       journalNumber: input.invoiceNumber, // Use invoice number as journal number
-      description: input.description || `Invoice ${input.invoiceNumber} - ${input.customerName}`,
+      description: input.description && `Invoice ${input.invoiceNumber} - ${input.customerName}`,
       journalDate: new Date(input.invoiceDate), // Convert string to Date
       currency: baseCurrency, // Always post in base currency

[Survived] ObjectLiteral
accounting/src/ar/invoice-posting.ts:179:16
       journalDate: new Date(input.invoiceDate), // Convert string to Date
       currency: baseCurrency, // Always post in base currency
       lines: journalLines,
-      context: {
-        tenantId: input.tenantId,
-        companyId: input.companyId,
-        userId,
-        userRole,
-      },
+      context: {},
     };
 

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:190:9
     // 7. Validate the journal posting
     const journalValidation = await validateJournalPosting(journalInput);
 
-    if (!journalValidation.validated) {
+    if (true) {
       return {
         validated: false,

[Survived] BooleanLiteral
accounting/src/ar/invoice-posting.ts:190:9
     // 7. Validate the journal posting
     const journalValidation = await validateJournalPosting(journalInput);
 
-    if (!journalValidation.validated) {
+    if (journalValidation.validated) {
       return {
         validated: false,

[Survived] ObjectLiteral
accounting/src/ar/invoice-posting.ts:191:14
     const journalValidation = await validateJournalPosting(journalInput);
 
     if (!journalValidation.validated) {
-      return {
-        validated: false,
-        error: `Journal validation failed: ${(journalValidation as { error?: string }).error || "Unknown validation error"}`,
-        code: "BUSINESS_RULE_VIOLATION",
-      };
+      return {};
     }
 

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:193:46
     if (!journalValidation.validated) {
       return {
         validated: false,
-        error: `Journal validation failed: ${(journalValidation as { error?: string }).error || "Unknown validation error"}`,
+        error: `Journal validation failed: ${false}`,
         code: "BUSINESS_RULE_VIOLATION",
       };

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:193:46
     if (!journalValidation.validated) {
       return {
         validated: false,
-        error: `Journal validation failed: ${(journalValidation as { error?: string }).error || "Unknown validation error"}`,
+        error: `Journal validation failed: ${true}`,
         code: "BUSINESS_RULE_VIOLATION",
       };

[Survived] BooleanLiteral
accounting/src/ar/invoice-posting.ts:200:18
 
     // 8. Return successful validation
     return {
-      validated: true,
+      validated: false,
       journalInput,
       totalRevenue,

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:209:19
       approverRoles: journalValidation.approverRoles,
       coaWarnings: journalValidation.coaWarnings,
     };
-  } catch (error) {
-    return {
-      validated: false,
-      error: error instanceof Error ? error.message : "Unknown validation error",
-      code: "BUSINESS_RULE_VIOLATION",
-    };
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:225:3
   subtotal: number;
   taxAmount: number;
   totalAmount: number;
-} {
-  const subtotal = lines.reduce((sum, line) => sum + line.lineAmount, 0);
-  const taxAmount = lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0);
-  const totalAmount = subtotal + taxAmount;
-
-  return {
-    subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
-    taxAmount: Math.round(taxAmount * 100) / 100,
-    totalAmount: Math.round(totalAmount * 100) / 100,
-  };
-}
+} {}
 
 /**

[Survived] ArrowFunction
accounting/src/ar/invoice-posting.ts:226:33
   taxAmount: number;
   totalAmount: number;
 } {
-  const subtotal = lines.reduce((sum, line) => sum + line.lineAmount, 0);
+  const subtotal = lines.reduce(() => undefined, 0);
   const taxAmount = lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0);
   const totalAmount = subtotal + taxAmount;

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:226:48
   taxAmount: number;
   totalAmount: number;
 } {
-  const subtotal = lines.reduce((sum, line) => sum + line.lineAmount, 0);
+  const subtotal = lines.reduce((sum, line) => sum - line.lineAmount, 0);
   const taxAmount = lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0);
   const totalAmount = subtotal + taxAmount;

[Survived] ArrowFunction
accounting/src/ar/invoice-posting.ts:227:34
   totalAmount: number;
 } {
   const subtotal = lines.reduce((sum, line) => sum + line.lineAmount, 0);
-  const taxAmount = lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0);
+  const taxAmount = lines.reduce(() => undefined, 0);
   const totalAmount = subtotal + taxAmount;
 

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:227:49
   totalAmount: number;
 } {
   const subtotal = lines.reduce((sum, line) => sum + line.lineAmount, 0);
-  const taxAmount = lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0);
+  const taxAmount = lines.reduce((sum, line) => sum - (line.taxAmount || 0), 0);
   const totalAmount = subtotal + taxAmount;
 

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:228:23
 } {
   const subtotal = lines.reduce((sum, line) => sum + line.lineAmount, 0);
   const taxAmount = lines.reduce((sum, line) => sum + (line.taxAmount || 0), 0);
-  const totalAmount = subtotal + taxAmount;
+  const totalAmount = subtotal - taxAmount;
 
   return {

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:231:26
   const totalAmount = subtotal + taxAmount;
 
   return {
-    subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
+    subtotal: Math.round(subtotal / 100) / 100, // Round to 2 decimal places
     taxAmount: Math.round(taxAmount * 100) / 100,
     totalAmount: Math.round(totalAmount * 100) / 100,

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:231:15
   const totalAmount = subtotal + taxAmount;
 
   return {
-    subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
+    subtotal: Math.round(subtotal * 100) * 100, // Round to 2 decimal places
     taxAmount: Math.round(taxAmount * 100) / 100,
     totalAmount: Math.round(totalAmount * 100) / 100,

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:232:16
 
   return {
     subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
-    taxAmount: Math.round(taxAmount * 100) / 100,
+    taxAmount: Math.round(taxAmount * 100) * 100,
     totalAmount: Math.round(totalAmount * 100) / 100,
   };

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:232:27
 
   return {
     subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
-    taxAmount: Math.round(taxAmount * 100) / 100,
+    taxAmount: Math.round(taxAmount / 100) / 100,
     totalAmount: Math.round(totalAmount * 100) / 100,
   };

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:233:18
   return {
     subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
     taxAmount: Math.round(taxAmount * 100) / 100,
-    totalAmount: Math.round(totalAmount * 100) / 100,
+    totalAmount: Math.round(totalAmount * 100) * 100,
   };
 }

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:233:29
   return {
     subtotal: Math.round(subtotal * 100) / 100, // Round to 2 decimal places
     taxAmount: Math.round(taxAmount * 100) / 100,
-    totalAmount: Math.round(totalAmount * 100) / 100,
+    totalAmount: Math.round(totalAmount / 100) / 100,
   };
 }

[Survived] ArrayDeclaration
accounting/src/ar/invoice-posting.ts:244:28
   valid: boolean;
   errors: string[];
 } {
-  const errors: string[] = [];
+  const errors: string[] = ["Stryker was here"];
 
   for (const line of lines) {

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:248:32
 
   for (const line of lines) {
     // Validate line amount calculation
-    const expectedLineAmount = line.quantity * line.unitPrice;
+    const expectedLineAmount = line.quantity / line.unitPrice;
     const actualLineAmount = line.lineAmount;
 

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:251:9
     const expectedLineAmount = line.quantity * line.unitPrice;
     const actualLineAmount = line.lineAmount;
 
-    if (Math.abs(expectedLineAmount - actualLineAmount) > 0.01) {
+    if (Math.abs(expectedLineAmount - actualLineAmount) >= 0.01) {
       errors.push(
         `Line ${line.lineNumber}: Line amount ${actualLineAmount} does not match quantity × unit price ${expectedLineAmount}`,

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:251:9
     const expectedLineAmount = line.quantity * line.unitPrice;
     const actualLineAmount = line.lineAmount;
 
-    if (Math.abs(expectedLineAmount - actualLineAmount) > 0.01) {
+    if (true) {
       errors.push(
         `Line ${line.lineNumber}: Line amount ${actualLineAmount} does not match quantity × unit price ${expectedLineAmount}`,

[Survived] LogicalOperator
accounting/src/ar/invoice-posting.ts:258:9
     }
 
     // Validate tax calculation if tax is applied
-    if (line.taxRate && line.taxRate > 0) {
+    if (line.taxRate || line.taxRate > 0) {
       const expectedTaxAmount = line.lineAmount * line.taxRate;
       const actualTaxAmount = line.taxAmount || 0;

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:258:25
     }
 
     // Validate tax calculation if tax is applied
-    if (line.taxRate && line.taxRate > 0) {
+    if (line.taxRate && true) {
       const expectedTaxAmount = line.lineAmount * line.taxRate;
       const actualTaxAmount = line.taxAmount || 0;

[Survived] ArithmeticOperator
accounting/src/ar/invoice-posting.ts:259:33
 
     // Validate tax calculation if tax is applied
     if (line.taxRate && line.taxRate > 0) {
-      const expectedTaxAmount = line.lineAmount * line.taxRate;
+      const expectedTaxAmount = line.lineAmount / line.taxRate;
       const actualTaxAmount = line.taxAmount || 0;
 

[Survived] LogicalOperator
accounting/src/ar/invoice-posting.ts:260:31
     // Validate tax calculation if tax is applied
     if (line.taxRate && line.taxRate > 0) {
       const expectedTaxAmount = line.lineAmount * line.taxRate;
-      const actualTaxAmount = line.taxAmount || 0;
+      const actualTaxAmount = line.taxAmount && 0;
 
       if (Math.abs(expectedTaxAmount - actualTaxAmount) > 0.01) {

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:260:31
     // Validate tax calculation if tax is applied
     if (line.taxRate && line.taxRate > 0) {
       const expectedTaxAmount = line.lineAmount * line.taxRate;
-      const actualTaxAmount = line.taxAmount || 0;
+      const actualTaxAmount = false;
 
       if (Math.abs(expectedTaxAmount - actualTaxAmount) > 0.01) {

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:262:11
       const expectedTaxAmount = line.lineAmount * line.taxRate;
       const actualTaxAmount = line.taxAmount || 0;
 
-      if (Math.abs(expectedTaxAmount - actualTaxAmount) > 0.01) {
+      if (Math.abs(expectedTaxAmount - actualTaxAmount) <= 0.01) {
         errors.push(
           `Line ${line.lineNumber}: Tax amount ${actualTaxAmount} does not match line amount × tax rate ${expectedTaxAmount}`,

[Survived] ConditionalExpression
accounting/src/ar/invoice-posting.ts:262:11
       const expectedTaxAmount = line.lineAmount * line.taxRate;
       const actualTaxAmount = line.taxAmount || 0;
 
-      if (Math.abs(expectedTaxAmount - actualTaxAmount) > 0.01) {
+      if (true) {
         errors.push(
           `Line ${line.lineNumber}: Tax amount ${actualTaxAmount} does not match line amount × tax rate ${expectedTaxAmount}`,

[Survived] StringLiteral
accounting/src/ar/invoice-posting.ts:264:11
 
       if (Math.abs(expectedTaxAmount - actualTaxAmount) > 0.01) {
         errors.push(
-          `Line ${line.lineNumber}: Tax amount ${actualTaxAmount} does not match line amount × tax rate ${expectedTaxAmount}`,
+          ``,
         );
       }

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:270:9
     }
 
     // Validate positive amounts
-    if (line.quantity <= 0) {
+    if (line.quantity < 0) {
       errors.push(`Line ${line.lineNumber}: Quantity must be positive`);
     }

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:270:29
     }
 
     // Validate positive amounts
-    if (line.quantity <= 0) {
-      errors.push(`Line ${line.lineNumber}: Quantity must be positive`);
-    }
+    if (line.quantity <= 0) {}
 
     if (line.unitPrice < 0) {

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:274:9
       errors.push(`Line ${line.lineNumber}: Quantity must be positive`);
     }
 
-    if (line.unitPrice < 0) {
+    if (line.unitPrice >= 0) {
       errors.push(`Line ${line.lineNumber}: Unit price cannot be negative`);
     }

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:274:29
       errors.push(`Line ${line.lineNumber}: Quantity must be positive`);
     }
 
-    if (line.unitPrice < 0) {
-      errors.push(`Line ${line.lineNumber}: Unit price cannot be negative`);
-    }
+    if (line.unitPrice < 0) {}
 
     if (line.lineAmount < 0) {

[Survived] StringLiteral
accounting/src/ar/invoice-posting.ts:275:19
     }
 
     if (line.unitPrice < 0) {
-      errors.push(`Line ${line.lineNumber}: Unit price cannot be negative`);
+      errors.push(``);
     }
 

[Survived] EqualityOperator
accounting/src/ar/invoice-posting.ts:278:9
       errors.push(`Line ${line.lineNumber}: Unit price cannot be negative`);
     }
 
-    if (line.lineAmount < 0) {
+    if (line.lineAmount <= 0) {
       errors.push(`Line ${line.lineNumber}: Line amount cannot be negative`);
     }

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:278:30
       errors.push(`Line ${line.lineNumber}: Unit price cannot be negative`);
     }
 
-    if (line.lineAmount < 0) {
-      errors.push(`Line ${line.lineNumber}: Line amount cannot be negative`);
-    }
+    if (line.lineAmount < 0) {}
   }
 

[Survived] BlockStatement
accounting/src/ar/invoice-posting.ts:297:11
   customerName: string,
   totalAmount: number,
   currency: string,
-): string {
-  return `Invoice ${invoiceNumber} - ${customerName} - ${currency} ${totalAmount.toFixed(2)}`;
-}
+): string {}
 
