[Survived] MethodExpression
packages/accounting/src/posting.ts:10:16
   accountId: z.string().uuid(),
   debit: z.number().nonnegative().default(0),
   credit: z.number().nonnegative().default(0),
-  description: z.string().max(200).optional(),
+  description: z.string().min(200).optional(),
   reference: z.string().max(100).optional(),
 });

[Survived] MethodExpression
packages/accounting/src/posting.ts:11:14
   debit: z.number().nonnegative().default(0),
   credit: z.number().nonnegative().default(0),
   description: z.string().max(200).optional(),
-  reference: z.string().max(100).optional(),
+  reference: z.string().min(100).optional(),
 });
 

[Survived] BlockStatement
packages/accounting/src/posting.ts:41:77
   }
 }
 
-export function validateBalanced(lines: Array<z.infer<typeof JournalLine>>) {
-  const debit = lines.reduce((s, l) => s + l.debit, 0);
-  const credit = lines.reduce((s, l) => s + l.credit, 0);
-
-  if (Math.abs(debit - credit) > 0.01) {
-    throw new PostingError(
-      "Journal must be balanced: debits must equal credits",
-      "UNBALANCED_JOURNAL",
-      { totalDebit: debit, totalCredit: credit, difference: Math.abs(debit - credit) },
-    );
-  }
-}
+export function validateBalanced(lines: Array<z.infer<typeof JournalLine>>) {}
 
 export function validateJournalLines(lines: Array<z.infer<typeof JournalLine>>) {

[Survived] ArrowFunction
packages/accounting/src/posting.ts:42:30
 }
 
 export function validateBalanced(lines: Array<z.infer<typeof JournalLine>>) {
-  const debit = lines.reduce((s, l) => s + l.debit, 0);
+  const debit = lines.reduce(() => undefined, 0);
   const credit = lines.reduce((s, l) => s + l.credit, 0);
 

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:42:40
 }
 
 export function validateBalanced(lines: Array<z.infer<typeof JournalLine>>) {
-  const debit = lines.reduce((s, l) => s + l.debit, 0);
+  const debit = lines.reduce((s, l) => s - l.debit, 0);
   const credit = lines.reduce((s, l) => s + l.credit, 0);
 

[Survived] ArrowFunction
packages/accounting/src/posting.ts:43:31
 
 export function validateBalanced(lines: Array<z.infer<typeof JournalLine>>) {
   const debit = lines.reduce((s, l) => s + l.debit, 0);
-  const credit = lines.reduce((s, l) => s + l.credit, 0);
+  const credit = lines.reduce(() => undefined, 0);
 
   if (Math.abs(debit - credit) > 0.01) {

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:43:41
 
 export function validateBalanced(lines: Array<z.infer<typeof JournalLine>>) {
   const debit = lines.reduce((s, l) => s + l.debit, 0);
-  const credit = lines.reduce((s, l) => s + l.credit, 0);
+  const credit = lines.reduce((s, l) => s - l.credit, 0);
 
   if (Math.abs(debit - credit) > 0.01) {

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:45:16
   const debit = lines.reduce((s, l) => s + l.debit, 0);
   const credit = lines.reduce((s, l) => s + l.credit, 0);
 
-  if (Math.abs(debit - credit) > 0.01) {
+  if (Math.abs(debit + credit) > 0.01) {
     throw new PostingError(
       "Journal must be balanced: debits must equal credits",

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:45:7
   const debit = lines.reduce((s, l) => s + l.debit, 0);
   const credit = lines.reduce((s, l) => s + l.credit, 0);
 
-  if (Math.abs(debit - credit) > 0.01) {
+  if (true) {
     throw new PostingError(
       "Journal must be balanced: debits must equal credits",

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:49:70
     throw new PostingError(
       "Journal must be balanced: debits must equal credits",
       "UNBALANCED_JOURNAL",
-      { totalDebit: debit, totalCredit: credit, difference: Math.abs(debit - credit) },
+      { totalDebit: debit, totalCredit: credit, difference: Math.abs(debit + credit) },
     );
   }

[Survived] EqualityOperator
packages/accounting/src/posting.ts:55:7
 }
 
 export function validateJournalLines(lines: Array<z.infer<typeof JournalLine>>) {
-  if (lines.length === 0) {
+  if (lines.length !== 0) {
     throw new PostingError("Journal must have at least one line", "NO_LINES");
   }

[Survived] BlockStatement
packages/accounting/src/posting.ts:55:27
 }
 
 export function validateJournalLines(lines: Array<z.infer<typeof JournalLine>>) {
-  if (lines.length === 0) {
-    throw new PostingError("Journal must have at least one line", "NO_LINES");
-  }
+  if (lines.length === 0) {}
 
   if (lines.length > 100) {

[Survived] EqualityOperator
packages/accounting/src/posting.ts:59:7
     throw new PostingError("Journal must have at least one line", "NO_LINES");
   }
 
-  if (lines.length > 100) {
+  if (lines.length >= 100) {
     throw new PostingError("Journal cannot have more than 100 lines", "TOO_MANY_LINES");
   }

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:59:7
     throw new PostingError("Journal must have at least one line", "NO_LINES");
   }
 
-  if (lines.length > 100) {
+  if (false) {
     throw new PostingError("Journal cannot have more than 100 lines", "TOO_MANY_LINES");
   }

[Survived] StringLiteral
packages/accounting/src/posting.ts:60:28
   }
 
   if (lines.length > 100) {
-    throw new PostingError("Journal cannot have more than 100 lines", "TOO_MANY_LINES");
+    throw new PostingError("", "TOO_MANY_LINES");
   }
 

[Survived] StringLiteral
packages/accounting/src/posting.ts:60:71
   }
 
   if (lines.length > 100) {
-    throw new PostingError("Journal cannot have more than 100 lines", "TOO_MANY_LINES");
+    throw new PostingError("Journal cannot have more than 100 lines", "");
   }
 

[Survived] BlockStatement
packages/accounting/src/posting.ts:64:48
   }
 
   // Validate each line has either debit or credit (but not both)
-  for (const [index, line] of lines.entries()) {
-    if (line.debit > 0 && line.credit > 0) {
-      throw new PostingError(
-        `Line ${index + 1}: Cannot have both debit and credit amounts`,
-        "INVALID_LINE_AMOUNTS",
-        { lineIndex: index, debit: line.debit, credit: line.credit },
-      );
-    }
-
-    if (line.debit === 0 && line.credit === 0) {
-      throw new PostingError(
-        `Line ${index + 1}: Must have either debit or credit amount`,
-        "ZERO_AMOUNTS",
-        { lineIndex: index },
-      );
-    }
-  }
+  for (const [index, line] of lines.entries()) {}
 }
 

[Survived] EqualityOperator
packages/accounting/src/posting.ts:65:9
 
   // Validate each line has either debit or credit (but not both)
   for (const [index, line] of lines.entries()) {
-    if (line.debit > 0 && line.credit > 0) {
+    if (line.debit <= 0 && line.credit > 0) {
       throw new PostingError(
         `Line ${index + 1}: Cannot have both debit and credit amounts`,

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:65:27
 
   // Validate each line has either debit or credit (but not both)
   for (const [index, line] of lines.entries()) {
-    if (line.debit > 0 && line.credit > 0) {
+    if (line.debit > 0 && true) {
       throw new PostingError(
         `Line ${index + 1}: Cannot have both debit and credit amounts`,

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:67:17
   for (const [index, line] of lines.entries()) {
     if (line.debit > 0 && line.credit > 0) {
       throw new PostingError(
-        `Line ${index + 1}: Cannot have both debit and credit amounts`,
+        `Line ${index - 1}: Cannot have both debit and credit amounts`,
         "INVALID_LINE_AMOUNTS",
         { lineIndex: index, debit: line.debit, credit: line.credit },

[Survived] StringLiteral
packages/accounting/src/posting.ts:68:9
     if (line.debit > 0 && line.credit > 0) {
       throw new PostingError(
         `Line ${index + 1}: Cannot have both debit and credit amounts`,
-        "INVALID_LINE_AMOUNTS",
+        "",
         { lineIndex: index, debit: line.debit, credit: line.credit },
       );

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:73:9
       );
     }
 
-    if (line.debit === 0 && line.credit === 0) {
+    if (false) {
       throw new PostingError(
         `Line ${index + 1}: Must have either debit or credit amount`,

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:73:29
       );
     }
 
-    if (line.debit === 0 && line.credit === 0) {
+    if (line.debit === 0 && true) {
       throw new PostingError(
         `Line ${index + 1}: Must have either debit or credit amount`,

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:75:17
 
     if (line.debit === 0 && line.credit === 0) {
       throw new PostingError(
-        `Line ${index + 1}: Must have either debit or credit amount`,
+        `Line ${index - 1}: Must have either debit or credit amount`,
         "ZERO_AMOUNTS",
         { lineIndex: index },

[Survived] BlockStatement
packages/accounting/src/posting.ts:83:64
   }
 }
 
-export function validateSoDCompliance(context: PostingContext) {
-  const sodCheck = checkSoDCompliance("journal:post", context.userRole);
-
-  if (!sodCheck.allowed) {
-    throw new PostingError(
-      `User role '${context.userRole}' is not authorized to post journal entries`,
-      "SOD_VIOLATION",
-      { action: "journal:post", userRole: context.userRole, reason: sodCheck.reason },
-    );
-  }
-
-  return sodCheck;
-}
+export function validateSoDCompliance(context: PostingContext) {}
 
 export async function validateJournalPosting(input: JournalPostingInput) {

[Survived] StringLiteral
packages/accounting/src/posting.ts:84:39
 }
 
 export function validateSoDCompliance(context: PostingContext) {
-  const sodCheck = checkSoDCompliance("journal:post", context.userRole);
+  const sodCheck = checkSoDCompliance("", context.userRole);
 
   if (!sodCheck.allowed) {

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:86:7
 export function validateSoDCompliance(context: PostingContext) {
   const sodCheck = checkSoDCompliance("journal:post", context.userRole);
 
-  if (!sodCheck.allowed) {
+  if (true) {
     throw new PostingError(
       `User role '${context.userRole}' is not authorized to post journal entries`,

[Survived] BooleanLiteral
packages/accounting/src/posting.ts:86:7
 export function validateSoDCompliance(context: PostingContext) {
   const sodCheck = checkSoDCompliance("journal:post", context.userRole);
 
-  if (!sodCheck.allowed) {
+  if (sodCheck.allowed) {
     throw new PostingError(
       `User role '${context.userRole}' is not authorized to post journal entries`,

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:108:7
   validateBalanced(input.lines);
 
   // 4. Validate currency format
-  if (!input.currency || input.currency.length !== 3) {
+  if (false) {
     throw new PostingError("Invalid currency code", "INVALID_CURRENCY", {
       currency: input.currency,

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:108:7
   validateBalanced(input.lines);
 
   // 4. Validate currency format
-  if (!input.currency || input.currency.length !== 3) {
+  if (true) {
     throw new PostingError("Invalid currency code", "INVALID_CURRENCY", {
       currency: input.currency,

[Survived] StringLiteral
packages/accounting/src/posting.ts:109:28
 
   // 4. Validate currency format
   if (!input.currency || input.currency.length !== 3) {
-    throw new PostingError("Invalid currency code", "INVALID_CURRENCY", {
+    throw new PostingError("", "INVALID_CURRENCY", {
       currency: input.currency,
     });

[Survived] ObjectLiteral
packages/accounting/src/posting.ts:109:73
 
   // 4. Validate currency format
   if (!input.currency || input.currency.length !== 3) {
-    throw new PostingError("Invalid currency code", "INVALID_CURRENCY", {
-      currency: input.currency,
-    });
+    throw new PostingError("Invalid currency code", "INVALID_CURRENCY", {});
   }
 

[Survived] BlockStatement
packages/accounting/src/posting.ts:115:39
   }
 
   // 5. Validate journal date is not in the future
-  if (input.journalDate > new Date()) {
-    throw new PostingError("Journal date cannot be in the future", "FUTURE_DATE", {
-      journalDate: input.journalDate,
-    });
-  }
+  if (input.journalDate > new Date()) {}
 
   // 6. Validate COA flags and account rules

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:115:7
   }
 
   // 5. Validate journal date is not in the future
-  if (input.journalDate > new Date()) {
+  if (false) {
     throw new PostingError("Journal date cannot be in the future", "FUTURE_DATE", {
       journalDate: input.journalDate,

[Survived] ArrowFunction
packages/accounting/src/posting.ts:122:38
   }
 
   // 6. Validate COA flags and account rules
-  const accountIds = input.lines.map(line => line.accountId);
+  const accountIds = input.lines.map(() => undefined);
 
   try {

[Survived] BlockStatement
packages/accounting/src/posting.ts:124:7
   // 6. Validate COA flags and account rules
   const accountIds = input.lines.map(line => line.accountId);
 
-  try {
-    // Fetch account information
-    const [accountsMap, allAccounts] = await Promise.all([
-      getAccountsInfo(input.context, accountIds),
-      getAllAccountsInfo(input.context),
-    ]);
-
-    // Validate COA flags
-    const coaValidation = await validateCOAFlags(
-      input.lines,
-      input.currency,
-      accountsMap,
-      allAccounts,
-    );
-
-    return {
-      validated: true,
-      requiresApproval: sodCheck.requiresApproval,
-      approverRoles: sodCheck.requiresApproval ? ["manager", "admin"] : undefined,
-      coaWarnings: coaValidation.warnings,
-      accountDetails: coaValidation.accountDetails,
-      totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
-      totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
-    };
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof COAValidationError) {
       throw new PostingError(error.message, error.code, error.details);

[Survived] ObjectLiteral
packages/accounting/src/posting.ts:139:12
       allAccounts,
     );
 
-    return {
-      validated: true,
-      requiresApproval: sodCheck.requiresApproval,
-      approverRoles: sodCheck.requiresApproval ? ["manager", "admin"] : undefined,
-      coaWarnings: coaValidation.warnings,
-      accountDetails: coaValidation.accountDetails,
-      totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
-      totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
-    };
+    return {};
   } catch (error) {
     if (error instanceof COAValidationError) {

[Survived] StringLiteral
packages/accounting/src/posting.ts:142:62
     return {
       validated: true,
       requiresApproval: sodCheck.requiresApproval,
-      approverRoles: sodCheck.requiresApproval ? ["manager", "admin"] : undefined,
+      approverRoles: sodCheck.requiresApproval ? ["manager", ""] : undefined,
       coaWarnings: coaValidation.warnings,
       accountDetails: coaValidation.accountDetails,

[Survived] ArrowFunction
packages/accounting/src/posting.ts:145:38
       approverRoles: sodCheck.requiresApproval ? ["manager", "admin"] : undefined,
       coaWarnings: coaValidation.warnings,
       accountDetails: coaValidation.accountDetails,
-      totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
+      totalDebit: input.lines.reduce(() => undefined, 0),
       totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
     };

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:145:48
       approverRoles: sodCheck.requiresApproval ? ["manager", "admin"] : undefined,
       coaWarnings: coaValidation.warnings,
       accountDetails: coaValidation.accountDetails,
-      totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
+      totalDebit: input.lines.reduce((s, l) => s - l.debit, 0),
       totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
     };

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:146:49
       coaWarnings: coaValidation.warnings,
       accountDetails: coaValidation.accountDetails,
       totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
-      totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
+      totalCredit: input.lines.reduce((s, l) => s - l.credit, 0),
     };
   } catch (error) {

[Survived] ArrowFunction
packages/accounting/src/posting.ts:146:39
       coaWarnings: coaValidation.warnings,
       accountDetails: coaValidation.accountDetails,
       totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
-      totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
+      totalCredit: input.lines.reduce(() => undefined, 0),
     };
   } catch (error) {

[Survived] BlockStatement
packages/accounting/src/posting.ts:148:19
       totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
       totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
     };
-  } catch (error) {
-    if (error instanceof COAValidationError) {
-      throw new PostingError(error.message, error.code, error.details);
-    }
-    throw error;
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
packages/accounting/src/posting.ts:149:46
       totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
     };
   } catch (error) {
-    if (error instanceof COAValidationError) {
-      throw new PostingError(error.message, error.code, error.details);
-    }
+    if (error instanceof COAValidationError) {}
     throw error;
   }

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:149:9
       totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
     };
   } catch (error) {
-    if (error instanceof COAValidationError) {
+    if (false) {
       throw new PostingError(error.message, error.code, error.details);
     }

[Survived] BlockStatement
packages/accounting/src/posting.ts:156:63
   }
 }
 
-export async function postJournal(input: JournalPostingInput) {
-  // Validate all posting rules
-  const validation = await validateJournalPosting(input);
-
-  // Return validation result for the caller to handle DB operations
-  return {
-    validated: validation.validated,
-    requiresApproval: validation.requiresApproval,
-    approverRoles: validation.approverRoles,
-    coaWarnings: validation.coaWarnings || [],
-    accountDetails: validation.accountDetails,
-    totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
-    totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
-  };
-}
+export async function postJournal(input: JournalPostingInput) {}
 

[Survived] ConditionalExpression
packages/accounting/src/posting.ts:165:18
     validated: validation.validated,
     requiresApproval: validation.requiresApproval,
     approverRoles: validation.approverRoles,
-    coaWarnings: validation.coaWarnings || [],
+    coaWarnings: false,
     accountDetails: validation.accountDetails,
     totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),

[Survived] LogicalOperator
packages/accounting/src/posting.ts:165:18
     validated: validation.validated,
     requiresApproval: validation.requiresApproval,
     approverRoles: validation.approverRoles,
-    coaWarnings: validation.coaWarnings || [],
+    coaWarnings: validation.coaWarnings && [],
     accountDetails: validation.accountDetails,
     totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),

[Survived] ArrowFunction
packages/accounting/src/posting.ts:167:36
     approverRoles: validation.approverRoles,
     coaWarnings: validation.coaWarnings || [],
     accountDetails: validation.accountDetails,
-    totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
+    totalDebit: input.lines.reduce(() => undefined, 0),
     totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
   };

[Survived] ArithmeticOperator
packages/accounting/src/posting.ts:167:46
     approverRoles: validation.approverRoles,
     coaWarnings: validation.coaWarnings || [],
     accountDetails: validation.accountDetails,
-    totalDebit: input.lines.reduce((s, l) => s + l.debit, 0),
+    totalDebit: input.lines.reduce((s, l) => s - l.debit, 0),
     totalCredit: input.lines.reduce((s, l) => s + l.credit, 0),
   };
